[Killed] BlockStatement
src/func1.js:1:37
-function capitalizeFirstLetter(str) {
-    return str.charAt(0).toUpperCase() + str.slice(1);
-  }
+function capitalizeFirstLetter(str) {}
   
   module.exports = { capitalizeFirstLetter };
killedBy: capitalizeFirstLetter should capitalize the first letter of a string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello"
Received: undefined

[Killed] ArithmeticOperator
src/func1.js:2:12
 function capitalizeFirstLetter(str) {
-    return str.charAt(0).toUpperCase() + str.slice(1);
+    return str.charAt(0).toUpperCase() - str.slice(1);
   }
   
killedBy: capitalizeFirstLetter should capitalize the first letter of a string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello"
Received: NaN

[Killed] MethodExpression
src/func1.js:2:12
 function capitalizeFirstLetter(str) {
-    return str.charAt(0).toUpperCase() + str.slice(1);
+    return str.charAt(0).toLowerCase() + str.slice(1);
   }
   
killedBy: capitalizeFirstLetter should capitalize the first letter of a string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello"
Received: "hello"
