[Killed] BlockStatement
src/func2.js:1:22
-function isEven(num) {
-    return num % 2 === 0;
-  }
+function isEven(num) {}
   
   module.exports = { isEven };
killedBy: isEven checks if number is even
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/func2.js:2:12
 function isEven(num) {
-    return num % 2 === 0;
+    return true;
   }
   
killedBy: isEven checks if number is even
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/func2.js:2:12
 function isEven(num) {
-    return num % 2 === 0;
+    return false;
   }
   
killedBy: isEven checks if number is even
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
