[Killed] BlockStatement
src/func3.js:1:24
-function sumArray(arr) {
-    return arr.reduce((acc, val) => acc + val, 0);
-  }
+function sumArray(arr) {}
   
   module.exports = { sumArray };
killedBy: sumArray sums an array of numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] ArrowFunction
src/func3.js:2:23
 function sumArray(arr) {
-    return arr.reduce((acc, val) => acc + val, 0);
+    return arr.reduce(() => undefined, 0);
   }
   
killedBy: sumArray sums an array of numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] ArithmeticOperator
src/func3.js:2:37
 function sumArray(arr) {
-    return arr.reduce((acc, val) => acc + val, 0);
+    return arr.reduce((acc, val) => acc - val, 0);
   }
   
killedBy: sumArray sums an array of numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: -6
